# TableCellStyleOverrideOptions Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TableCellStyleOverrideOptions Constructor
TableCellStyleOverrideOptions Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TableCellStyleOverrideOptions()()()() | Creates a new instance with no style characteristics overridden. |
| TableCellStyleOverrideOptions(TableCellStyleOverrideOptions) | Creates a new instance by copying an existing instance. |

# See Also
TableCellStyleOverrideOptions Class
TableCellStyleOverrideOptions Members
Autodesk.Revit.DB Namespace